       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       AUTHOR Richard Velasquez.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-YEAR PIC 9(4).
       01 WS-RESULT PIC 9(1).
       LOCAL-STORAGE SECTION.
       01 LS-REMAINDER PIC 9(4).
       01 LS-RESULT PIC 9(4).
       PROCEDURE DIVISION.
       LEAP.
         DIVIDE WS-YEAR INTO 4 GIVING LS-RESULT REMAINDER LS-REMAINDER.
         IF LS-REMAINDER IS EQUAL 0
           DIVIDE WS-YEAR INTO 100 GIVING LS-RESULT 
           REMAINDER LS-REMAINDER.
           IF LS-REMAINDER NOT IS EQUAL 0
             DIVIDE WS-YEAR INTO 400 GIVING LS-RESULT 
             REMAINDER LS-REMAINDER.
             IF LS-REMAINDER IS EQUAL 0
               MOVE 1 TO WS-RESULT.
               GO TO RET-STATE.
             IF LS-REMAINDER NOT IS EQUAL 0
               GO TO NON-LEAP.
           IF LS-REMAINDER IS EQUAL 0
            GO TO NON-LEAP.
         IF LS-REMAINDER NOT IS EQUAL 0
           GO TO NON-LEAP.
         NON-LEAP.
           MOVE 0 TO WS-RESULT.
       RET-STATE.
       CONTINUE.
       LEAP-EXIT.
       EXIT.
